## Midterm Project - Sakila Rentals

### Prerequisites:

#### Import libraries

In [1]:
import os
import json
import numpy
import datetime
import pandas as pd

import pymongo
from sqlalchemy import create_engine

# !pip install pymysql
import pymysql

#### Declare and assign connection variables for the MongoDB server, the MySQL server, and databases

In [2]:
mysql_host = "localhost"
mysql_uid = "root"
mysql_pwd = "Passw0rd123"

atlas_cluster = "ds2002.ebys8h5"
atlas_uid = "vdq8tp"
atlas_pwd = "Iforgotit!01"

mongo_conn_str = {"local" : f"mongodb://localhost:27017/",
    "atlas" : f"mongodb+srv://{atlas_uid}:{atlas_pwd}@{atlas_cluster}.mongodb.net"
}

sql_conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{mysql_host}"

src_dbname = "sakila"
dst_dbname = "sakila_dw"

print(f"Local Connection String: {mongo_conn_str['local']}")
print(f"Atlas Connection String: {mongo_conn_str['atlas']}")

Local Connection String: mongodb://localhost:27017/
Atlas Connection String: mongodb+srv://vdq8tp:Iforgotit!01@ds2002.ebys8h5.mongodb.net

#### Define functions for getting data from and setting data into databases

In [3]:
def get_sql_dataframe(user_id, pwd, host_name, db_name, sql_query):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{mysql_host}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    
    '''Invoke the pd.read_sql() function to query the database, and fill a Pandas DataFrame.'''
    conn = sqlEngine.connect()
    dframe = pd.read_sql(sql_query, conn);
    conn.close()
    
    return dframe


def get_mongo_dataframe(conn_str, db_name, collection, query):
    '''Create a connection to MongoDB'''
    client = pymongo.MongoClient(conn_str)
    
    '''Query MongoDB, and fill a python list with documents to create a DataFrame'''
    db = client[db_name]
    dframe = pd.DataFrame(list(db[collection].find(query)))
    dframe.drop(['_id'], axis=1, inplace=True)
    client.close()
    return dframe


def set_dataframe(user_id, pwd, host_name, db_name, df, table_name, pk_column, db_operation):
    '''Create a connection to the MySQL database'''
    conn_str = f"mysql+pymysql://{mysql_uid}:{mysql_pwd}@{mysql_host}/{db_name}"
    sqlEngine = create_engine(conn_str, pool_recycle=3600)
    connection = sqlEngine.connect()
    
    '''Invoke the Pandas DataFrame .to_sql( ) function to either create, or append to, a table'''
    if db_operation == "insert":
        df.to_sql(table_name, con=connection, index=False, if_exists='replace')
        sqlEngine.execute(f"ALTER TABLE {table_name} ADD PRIMARY KEY ({pk_column});")
            
    elif db_operation == "update":
        df.to_sql(table_name, con=connection, index=False, if_exists='append')
    
    connection.close()

### MySQL:

#### ETL directly from source database into destination database
> CSV files were pre-loaded using the MySQL-Into-CSV script in MySQL Workbench

> The dim_date table was pre-inserted into the sakila_dw database using the MySQL-Date-Dimension script in MySQL Workbench

In [6]:
sqlEngine = create_engine(sql_conn_str, pool_recycle=3600)

sqlEngine.execute(f"DROP DATABASE IF EXISTS `{dst_dbname}`;")
sqlEngine.execute(f"CREATE DATABASE `{dst_dbname}`;")
sqlEngine.execute(f"USE {dst_dbname};")

In [7]:
df_customers = pd.read_csv('data/sakila_customer.csv')
df_customers.rename(columns={"customer_id":"customer_key", "store_id":"store_key"}, inplace=True)
df_customers.head(2)

,customer_key,store_key,first_name,last_name,email,active
0,1,1,MARY,SMITH,MARY.SMITH@sakilacustomer.org,1
1,2,1,PATRICIA,JOHNSON,PATRICIA.JOHNSON@sakilacustomer.org,1

In [8]:
df_staff = pd.read_csv('data/sakila_staff.csv')
df_staff.rename(columns={"staff_id":"staff_key", "store_id":"store_key"}, inplace=True)
df_staff.head(2)

,staff_key,first_name,last_name,email,store_key,active,username,password
0,1,Mike,Hillyer,Mike.Hillyer@sakilastaff.com,1,1,Mike,8cb2237d0679ca88db6464eac60da96345513964
1,2,Jon,Stephens,Jon.Stephens@sakilastaff.com,2,1,Jon,\N

In [9]:
df_stores = pd.read_csv('data/sakila_store.csv')
df_stores.rename(columns={"store_id":"store_key", "manager_staff_id":"manager_staff_key"}, inplace=True)
df_stores.head(2)

   store_key  manager_staff_key
0          1                  1
1          2                  2

In [10]:
db_operation = "insert"
tables = [('dim_customers', df_customers, 'customer_key'),
          ('dim_staff', df_staff, 'staff_key'),
          ('dim_stores', df_stores, 'store_key'),]
for table_name, dataframe, primary_key in tables:
    set_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, dataframe, table_name, primary_key, db_operation)

### MongoDB

#### Export dataframes into JSON and populate MongoDB with source data
> JSON files were pre-loaded using the export wizard in MySQL Workbench directly without the last_update column

In [58]:
client = pymongo.MongoClient(mongo_conn_str["local"])
db = client[src_dbname]

# Gets the path of the Current Working Directory for this Notebook, and then Appends the 'data' directory.
data_dir = os.path.join(os.getcwd(), 'data')

json_files = {"film" : 'sakila_film.json',
              "inventory" : 'sakila_inventory.json',
              "language" : 'sakila_language.json',             
              "payment" : 'sakila_payment.json',
              "rental" : 'sakila_rental.json'
             }

for file in json_files:
    db.drop_collection(file)
    json_file = os.path.join(data_dir, json_files[file])
    with open(json_file, 'r') as openfile:
        json_object = json.load(openfile)
        file = db[file]
        result = file.insert_many(json_object)
        #print(f"{file} was successfully loaded.")

        
client.close()

#### ETL film dimension table into destination database

In [47]:
query = {}
collection = "film"

df_films = get_mongo_dataframe(mongo_conn_str['local'], src_dbname, collection, query)
df_films.head(2)

,film_id,title,description,release_year,language_id,original_language_id,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,1,0,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,1,0,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

In [48]:
query = {}
collection = "language"

df_languages = get_mongo_dataframe(mongo_conn_str['local'], src_dbname, collection, query)
df_languages.rename(columns={"name":"language"}, inplace=True)
df_languages.head(2)

   language_id language
0            1  English
1            2  Italian

In [49]:
df_films = pd.merge(df_films, df_languages, on='language_id', how='left')
df_films.drop(['language_id', 'original_language_id'], axis=1, inplace=True)
df_films.head(2)

,film_id,title,description,release_year,rental_duration,rental_rate,length,replacement_cost,rating,special_features,language
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes",English
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,3,4.99,48,12.99,G,"Trailers,Deleted Scenes",English

In [50]:
# reorder columns
ordered_columns = ['film_id', 'title', 'description', 'release_year', 'language', 'rental_duration', 'rental_rate', 'length', 'replacement_cost', 'rating', 'special_features']
df_films = df_films[ordered_columns]
df_films.rename(columns={"film_id":"film_key"}, inplace=True)
df_films.head(2)

,film_key,title,description,release_year,language,rental_duration,rental_rate,length,replacement_cost,rating,special_features
0,1,ACADEMY DINOSAUR,A Epic Drama of a Feminist And a Mad Scientist...,2006,English,6,0.99,86,20.99,PG,"Deleted Scenes,Behind the Scenes"
1,2,ACE GOLDFINGER,A Astounding Epistle of a Database Administrat...,2006,English,3,4.99,48,12.99,G,"Trailers,Deleted Scenes"

In [51]:
table_name = "dim_films"
primary_key = "film_key"
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, df_films, table_name, primary_key, db_operation)

#### ETL rental fact table into destination database

In [60]:
query = {}
collection = "rental"

df_rentals = get_mongo_dataframe(mongo_conn_str['local'], src_dbname, collection, query)
df_rentals.rename(columns={"customer_id":"renting_customer_key", "staff_id":"rental_staff_key"}, inplace=True)
df_rentals.rental_date = df_rentals.rental_date.astype('datetime64').dt.date
df_rentals.return_date = df_rentals.return_date.astype('datetime64').dt.date
df_rentals.head(2)

,rental_id,rental_date,inventory_id,renting_customer_key,return_date,rental_staff_key
0,1,2005-05-24,367,130,2005-05-26,1
1,2,2005-05-24,1525,459,2005-05-28,1

In [61]:
query = {}
collection = "inventory"

df_inventory = get_mongo_dataframe(mongo_conn_str['local'], src_dbname, collection, query)
df_inventory.head(2)

   inventory_id  film_id  store_id
0             1        1         1
1             2        1         1

In [62]:
query = {}
collection = "payment"

df_payments = get_mongo_dataframe(mongo_conn_str['local'], src_dbname, collection, query)
df_payments.rename(columns={"customer_id":"paying_customer_key", "staff_id":"cashier_staff_key"}, inplace=True)
df_payments.payment_date = df_payments.payment_date.astype('datetime64').dt.date
df_payments.head(2)

,payment_id,paying_customer_key,cashier_staff_key,rental_id,amount,payment_date
0,1,1,1,76,2.99,2005-05-25
1,2,1,1,573,0.99,2005-05-28

In [63]:
df_fact_rentals = pd.merge(df_rentals, df_inventory, on='inventory_id', how='left')
df_fact_rentals.drop(['inventory_id'], axis=1, inplace=True)
df_fact_rentals = pd.merge(df_fact_rentals, df_payments, on='rental_id', how='left')
df_fact_rentals.drop(['payment_id'], axis=1, inplace=True)
df_fact_rentals.head(2)

,rental_id,rental_date,renting_customer_key,return_date,rental_staff_key,film_id,store_id,paying_customer_key,cashier_staff_key,amount,payment_date
0,1,2005-05-24,130,2005-05-26,1,80,1,130,1,2.99,2005-05-24
1,2,2005-05-24,459,2005-05-28,1,333,2,459,2,2.99,2005-05-24

In [64]:
sql_date = "SELECT date_key, full_date FROM sakila_dw.dim_date"
df_date = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, sql_date)
df_date.full_date = df_date.full_date.astype('datetime64').dt.date
df_date.head(2)

   date_key   full_date
0  20050501  2005-05-01
1  20050502  2005-05-02

In [65]:
df_rental_date = df_date.rename(columns={"date_key":"rental_date_key", "full_date":"rental_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_rental_date, on='rental_date', how='inner')
df_fact_rentals.drop(['rental_date'], axis=1, inplace=True)

df_return_date = df_date.rename(columns={"date_key":"return_date_key", "full_date":"return_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_return_date, on='return_date', how='inner')
df_fact_rentals.drop(['return_date'], axis=1, inplace=True)

df_payment_date = df_date.rename(columns={"date_key":"payment_date_key", "full_date":"payment_date"})
df_fact_rentals = pd.merge(df_fact_rentals, df_payment_date, on='payment_date', how='inner')
df_fact_rentals.drop(['payment_date'], axis=1, inplace=True)

df_fact_rentals.head(2)

,rental_id,renting_customer_key,rental_staff_key,film_id,store_id,paying_customer_key,cashier_staff_key,amount,rental_date_key,return_date_key,payment_date_key
0,1,130,1,80,1,130,1,2.99,20050524,20050526,20050524
1,2,459,1,333,2,459,2,2.99,20050524,20050528,20050524

In [66]:
ordered_columns = ['rental_id', 'rental_date_key', 'renting_customer_key', 'return_date_key', 'rental_staff_key', 'film_id', 'store_id', 'paying_customer_key', 'cashier_staff_key', 'payment_date_key', 'amount']
df_fact_rentals = df_fact_rentals[ordered_columns]
df_fact_rentals.rename(columns={"rental_id":"rental_key", "film_id":"film_key", "store_id":"store_key"}, inplace=True)
df_fact_rentals.insert(0, "fact_rental_key", range(1, df_fact_rentals.shape[0]+1))
df_fact_rentals.head(2)

,fact_rental_key,rental_key,rental_date_key,renting_customer_key,return_date_key,rental_staff_key,film_key,store_key,paying_customer_key,cashier_staff_key,payment_date_key,amount
0,1,1,20050524,130,20050526,1,80,1,130,1,20050524,2.99
1,2,2,20050524,459,20050528,1,333,2,459,2,20050524,2.99

In [67]:
table_name = "fact_rentals"
primary_key = "fact_rental_key"
db_operation = "insert"
set_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, df_fact_rentals, table_name, primary_key, db_operation)

#### Check that tables were created, populated, and inserted correctly into the destination database

In [69]:
sql_customer_count = "SELECT store_key, COUNT(*) AS number_of_customers FROM sakila_dw.dim_customers GROUP BY store_key;"
df_customer_count = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, sql_customer_count)
df_customer_count

   store_key  number_of_customers
0          1                  326
1          2                  273

In [71]:
sql_avg_film_price = "SELECT rating, AVG(replacement_cost) AS average_fim_price FROM sakila_dw.dim_films GROUP BY rating;"
df_avg_film_price = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, sql_avg_film_price)
df_avg_film_price

  rating  average_fim_price
0     PG          18.959072
1      G          20.124831
2  NC-17          20.137619
3  PG-13          20.402556
4      R          20.231026

In [74]:
sql_total_revenue = "SELECT film_key, SUM(amount) AS total_revenue FROM sakila_dw.fact_rentals GROUP BY film_key ORDER BY SUM(amount) DESC;"
df_total_revenue = get_sql_dataframe(mysql_uid, mysql_pwd, mysql_host, dst_dbname, sql_total_revenue)
df_total_revenue

     film_key  total_revenue
0         879         231.73
1         973         223.69
2        1000         214.69
3         369         209.69
4         764         204.72
..        ...            ...
953       996           6.93
954       261           6.93
955       335           5.95
956       635           5.94
957       885           5.94

[958 rows x 2 columns]